In [155]:
# Dependencies
import pandas as pd

In [156]:
# # Modules
# import os
# import csv

In [157]:
# Load in file
student_file = "../Resources/students_complete.csv"
schools_file = "../Resources/schools_complete.csv"

In [158]:
# Open the students file in CSV
student_df = pd.read_csv(student_file)
student_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [159]:
# Open the schools file in CSV
schools_df = pd.read_csv(schools_file)
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [162]:
# Count total number of schools in district
total_schools = len(student_df["school_name"].unique())
total_schools

15

In [163]:
# Count total number of students
student_count = len(student_df)
student_count

39170

In [165]:
# Sum total budget
total_budget = schools_df["budget"].sum()
total_budget

24649428

In [166]:
# Calculate average math and reading scores
average_math = student_df["math_score"].mean()
average_reading = student_df["reading_score"].mean()

In [194]:
# Calculate number of of students passing for math and reading    
math_passing_df = student_df.loc[student_df["math_score"] >= 70,["math_score"]]
count_math = len(math_passing_df)
reading_passing_df = student_df.loc[student_df["reading_score"] >= 70,["reading_score"]]
count_reading = len(reading_passing_df)

# Divide passing scores for math and reading by total student count
percentage_passing_math = count_math/student_count
percentage_passing_reading = count_reading/student_count

In [191]:
overall1 = student_df.loc[student_df["math_score"] >= 70 & (student_df["reading_score"] >= 70)]
# overall_count = len(overall)
len(overall1)

# df[(df['MRP'] <= 2000) & (df['Discount'] > 0)]

39170

In [195]:
district_df = pd.DataFrame({
    "Total Schools":[total_schools],
    "Total Students":f'{student_count:,}',
    "Total Budget":f'${total_budget:,}',
    "Average Math Score":[average_math],
    "Average Reading Score":[average_reading],
    "% Passing Math":f'{percentage_passing_math:.2%}',
    "% Passing Reading":f'{percentage_passing_reading:.2%}',
})
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading
0,15,"39,170","$24,649,428",78.985371,81.87784,74.98%,85.81%

In [202]:
# school_summary 
# School Name
# School Type
# Total Students
# Total School Budget
# Per Student Budget
# Average Math Score
# Average Reading Score
# % Passing Math (The percentage of students that passed math.)
# % Passing Reading (The percentage of students that passed reading.)
# % Overall Passing (The percentage of students that passed math and reading.)
schools_df = pd.read_csv(schools_file)
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [208]:
school_summary_df = schools_df[["school_name", "type", "budget"]]
school_summary_df.head()
school_summary_df

              school_name      type   budget
0       Huang High School  District  1910635
1    Figueroa High School  District  1884411
2     Shelton High School   Charter  1056600
3   Hernandez High School  District  3022020
4     Griffin High School   Charter   917500
5      Wilson High School   Charter  1319574
6     Cabrera High School   Charter  1081356
7      Bailey High School  District  3124928
8      Holden High School   Charter   248087
9        Pena High School   Charter   585858
10     Wright High School   Charter  1049400
11  Rodriguez High School  District  2547363
12    Johnson High School  District  3094650
13       Ford High School  District  1763916
14     Thomas High School   Charter  1043130

In [232]:
student_by_school_counts = pd.DataFrame(student_df["school_name"].value_counts())
student_by_school_counts.head(15)
total_students_df = student_by_school_counts.rename(
    columns={"school_name": "Total Students"})
total_students_df.head(15)

                       Total Students
Bailey High School               4976
Johnson High School              4761
Hernandez High School            4635
Rodriguez High School            3999
Figueroa High School             2949
Huang High School                2917
Ford High School                 2739
Wilson High School               2283
Cabrera High School              1858
Wright High School               1800
Shelton High School              1761
Thomas High School               1635
Griffin High School              1468
Pena High School                  962
Holden High School                427

In [234]:
# student_by_school_average = student_df["reading_score"].mean()
schools = student_df.groupby("school_name")

# Get the average of each column within the GroupBy object
schools[["reading_score", "math_score"]].mean()

                       reading_score  math_score
school_name
Bailey High School         81.033963   77.048432
Cabrera High School        83.975780   83.061895
Figueroa High School       81.158020   76.711767
Ford High School           80.746258   77.102592
Griffin High School        83.816757   83.351499
Hernandez High School      80.934412   77.289752
Holden High School         83.814988   83.803279
Huang High School          81.182722   76.629414
Johnson High School        80.966394   77.072464
Pena High School           84.044699   83.839917
Rodriguez High School      80.744686   76.842711
Shelton High School        83.725724   83.359455
Thomas High School         83.848930   83.418349
Wilson High School         83.989488   83.274201
Wright High School         83.955000   83.682222